<template>
  <div class="notes">
    <box-title>讲义</box-title>

    <article v-html="content">

    </article>
  </div>
</template>

<script lang="ts">
import { defineComponent } from 'vue'

export default defineComponent({
  name: 'Note',
  props: {
    content: {
      type: String,
      default: `
      一、基本介绍
1.什么是小米金融理财？
小米金融理财是小米官方的金融理财平台，通过与多家大型金融机构合作，为用户提供安全、专业、便捷的理财服务。您可以在这里选购不同类型、不同期限、不同收益的理财产品，产品类型涵盖了保险理财、基金、资管等，全方位满足您的理财需求，为您实现财富增值。
小米金融作为理财服务平台，协助金融机构提供相关金融产品的开户、交易、资产信息查询以及支付清算等服务。小米金融不发行理财产品，不参与管理，也不承担产品风险。金融机构作为理财产品的提供方，负责产品设计及管理，并与购买产品的投资者签定相关协议。您在小米金融购买理财产品时，需仔细了解产品投资风险、重分考虑自身风险承受能力，独立做出投资理财决策。
2.什么是定期产品？
定期产品是小米金融理财为投资者打造的类固定收益、固定期限的理财产品系列，产品期限从几天～几年不等，充分满足投资者不同的流动性需求，拥有期限丰富、预期收益较高、风险较低的特点。
定期产品包括：保险理财产品，含投连险和万能险，兼具投资与保障功能；券商资管产品，到期自动续投、自动付息；米月赚，中短期理财，收益稳健。
3.什么是活期产品？
活期产品是小米金融理财推出的类活期、可灵活存取的产品系列，以满足投资人对资金流动性的超高需求，收益和风险相对较低。
活期产品包括：精选货币基金，快速赎回分分钟即可到账；保险理财产品，含投连险和万能险，兼具投资与保障功能。
4.什么是基金产品？
基金产品是小米金融理财推出的多品类、丰富的基金产品系列，为投资者资产配置提供更多样化的选择。购买基金产品即有机会博取更高的收益，也存在亏损的可能性。一般而言，基金产品风险高于活期产品和定期产品，但低于直接投资股票，建议投资者谨慎选择。
基金包括：精选的债券基金、指数基金、黄金基金、股票基金、以及多种海外投资基金等千余种。
`
    }
  }
})
</script>
